### 1. Acquiring Data

In [1]:
# Steps to analyzing data
# 1. Get the data
# 2. Review the data
# 3. Ask questions based on what you found (get as creative as you need to)
# 4. Clean your data

In [2]:
import unicodecsv as csv
from statistics import mean

In [3]:
# long way
# enrollment_data = []
# file = open('enrollments.csv', 'rb')
# data = csv.DictReader(file)
# for i in data:
#     enrollment_data.append(i)
# file.close()

In [4]:
# shorter way
# with open('enrollments.csv', 'rb') as file:
#     data = csv.DictReader(file)
#     enrollment_data = list(data)

In [5]:
# best way
def read_from_csv(filename):
    with open(filename, 'rb') as file:
        data = csv.DictReader(file)
        return list(data)

In [6]:
enrollment_data = read_from_csv('enrollments.csv')
engagement_data = read_from_csv('engagements.csv')
submission_data = read_from_csv('submissions.csv')

### 2. Cleaning Data

In [7]:
from datetime import datetime as dt

def convert_to_date(date_string):
    if date_string == '':
        return None
    else:
        return dt.strptime(date_string, '%Y-%m-%d')
    
def convert_to_int(int_string):
    if int_string == '':
        return None
    else:
        return int(int_string)
    
def convert_to_float(float_string):
    if float_string == '':
        return None
    else:
        return float(float_string)
    
def convert_to_bool(bool_string):
    if bool_string == '':
        return None
    elif bool_string == 'TRUE':
        return True
    elif bool_string == 'FALSE':
        return False

##### Fix data types

In [8]:
for i in enrollment_data:
    i['join_date'] = convert_to_date(i['join_date'])
    i['cancel_date'] = convert_to_date(i['cancel_date'])
    i['days_to_cancel'] = convert_to_int(i['days_to_cancel'])
    i['is_enrolled'] = convert_to_bool(i['is_enrolled'])
    i['is_canceled'] = convert_to_bool(i['is_canceled'])

In [9]:
enrollment_data[0]

{'account_key': '448',
 'status': 'canceled',
 'join_date': datetime.datetime(2017, 11, 10, 0, 0),
 'cancel_date': datetime.datetime(2018, 1, 14, 0, 0),
 'days_to_cancel': 65,
 'is_enrolled': True,
 'is_canceled': True}

In [10]:
for i in engagement_data:
    i['utc_date'] = convert_to_date(i['utc_date'])
    i['num_courses_visited'] = convert_to_int(i['num_courses_visited'])
    i['total_minutes_visited'] = convert_to_float(i['total_minutes_visited'])
    i['lessons_completed'] = convert_to_float(i['lessons_completed'])
    i['projects_completed'] = convert_to_float(i['projects_completed'])

In [11]:
engagement_data[0]

{'acct': '0',
 'utc_date': datetime.datetime(2018, 1, 9, 0, 0),
 'num_courses_visited': 1,
 'total_minutes_visited': 11.6793745,
 'lessons_completed': 0.0,
 'projects_completed': 0.0}

In [12]:
for i in submission_data:
    i['creation_date'] = convert_to_date(i['creation_date'])
    i['completion_date'] = convert_to_date(i['completion_date'])

In [13]:
submission_data[0]

{'creation_date': datetime.datetime(2018, 1, 14, 0, 0),
 'completion_date': datetime.datetime(2018, 1, 16, 0, 0),
 'assigned_rating': 'UNGRADED',
 'account_key': '256',
 'lesson_key': '3176718735',
 'processing_state': 'EVALUATED'}

In [14]:
for i in engagement_data:
    i['account_key'] = i['acct']
    del i['acct']

In [15]:
for i in enrollment_data:
    i['is_student'] = i['is_enrolled']
    del i['is_enrolled']

In [16]:
engagement_data[0]

{'utc_date': datetime.datetime(2018, 1, 9, 0, 0),
 'num_courses_visited': 1,
 'total_minutes_visited': 11.6793745,
 'lessons_completed': 0.0,
 'projects_completed': 0.0,
 'account_key': '0'}

In [17]:
print(f"Enrollment records: {len(enrollment_data)}")
print(f"Engagement records: {len(engagement_data)}")
print(f"Submissions records: {len(submission_data)}")

def get_unique_records(data, column_name):
    unique_data = set()
    for i in data:
        unique_data.add(i[column_name])
    return unique_data


print()

unique_enrollment_data = get_unique_records(enrollment_data, 'account_key')
unique_engagement_data = get_unique_records(engagement_data, 'account_key')
unique_submission_data = get_unique_records(submission_data, 'account_key')

print(f"Unique enrollment records: {len(unique_enrollment_data)}")
print(f"Unique engagement records: {len(unique_engagement_data)}")
print(f"Unique submissions records: {len(unique_submission_data)}")

Enrollment records: 1640
Engagement records: 136240
Submissions records: 3642

Unique enrollment records: 1302
Unique engagement records: 1237
Unique submissions records: 743

In [18]:
outliers = 0
for i in enrollment_data:
    if i['account_key'] not in unique_engagement_data and i['join_date'] != i['cancel_date']:
        outliers +=1
        print(i, end='\n\n')
print(outliers)

{'account_key': '1304', 'status': 'canceled', 'join_date': datetime.datetime(2018, 1, 10, 0, 0), 'cancel_date': datetime.datetime(2018, 3, 10, 0, 0), 'days_to_cancel': 59, 'is_canceled': True, 'is_student': True}

{'account_key': '1304', 'status': 'canceled', 'join_date': datetime.datetime(2018, 3, 10, 0, 0), 'cancel_date': datetime.datetime(2018, 6, 17, 0, 0), 'days_to_cancel': 99, 'is_canceled': True, 'is_student': True}

{'account_key': '1101', 'status': 'current', 'join_date': datetime.datetime(2018, 2, 25, 0, 0), 'cancel_date': None, 'days_to_cancel': None, 'is_canceled': False, 'is_student': True}

3

In [19]:
# Check for possible test accounts.
# is_student shows True for questionable looking accounts, but shows False for legit accounts
test_accounts = set()
for i in enrollment_data:
    if i['is_student']:
        test_accounts.add(i['account_key'])
print(f"{len(test_accounts)} possible test accounts were found.")

6 possible test accounts were found.

In [20]:
def remove_test_accounts(data):
    new_records = []
    for i in data:
        if i['account_key'] in test_accounts:
            pass
        else:
            new_records.append(i)
    return new_records

In [21]:
true_enrollments = remove_test_accounts(enrollment_data)
true_engagements = remove_test_accounts(engagement_data)
true_submissions = remove_test_accounts(submission_data)

print(f"True enrollment records: {len(true_enrollments)}")
print(f"True engagement records: {len(true_engagements)}")
print(f"True submissions records: {len(true_submissions)}")

True enrollment records: 1622
True engagement records: 135656
True submissions records: 3634

### 3. Answering Questions w/ Data

In [22]:
# What was the average number of days to cancel?
days_to_cancel = mean([i['days_to_cancel'] for i in enrollment_data if i['days_to_cancel'] is not None])
print(f"It took students about {round(days_to_cancel, 1)} days to cancel their subscription.")

It took students about 43.9 days to cancel their subscription.

#### Find all quality accounts where:
##### 1. 'is_canceled' is False - accounts are currently active
##### 2. 'days_to_cancel' is greater than 7 - people who lasted past the free trial
##### 3. retrieve one record with most recent 'join_date', but have account keys that show up multiple times - account holder may have stopped and started their trials many times. Only pull the most recent one, so we don't screw up our data

In [23]:
# Find accounts that are in good standing and fit all above criteria
accounts_in_good_standing = dict()
for i in true_enrollments:
    if not i['is_canceled'] or i['days_to_cancel'] > 7:
        if i['account_key'] not in accounts_in_good_standing or i['join_date'] > accounts_in_good_standing[i['account_key']]:
            accounts_in_good_standing[i['account_key']] = i['join_date']
len(accounts_in_good_standing)

# { 'account_key': datetime_objects }

995

In [24]:
# accounts_in_good_standing

In [25]:
# Remove all free trials
def remove_free_trials(data):
    free_trials_list = []
    for i in data:
        if i['account_key'] in accounts_in_good_standing:
            free_trials_list.append(i)
    return free_trials_list

quality_enrollments = remove_free_trials(true_enrollments)
quality_engagements = remove_free_trials(true_engagements)
quality_submissions = remove_free_trials(true_submissions)

print(f"{len(quality_enrollments)} Quality enrollments")
print(f"{len(quality_engagements)} Quality engagements")
print(f"{len(quality_submissions)} Quality submissions")

1293 Quality enrollments
134549 Quality engagements
3618 Quality submissions

In [26]:
# Question: How many enrollees have active engagement within the first week?
def engagements_within_first_week(date_joined, date_of_first_engagement):
    time_difference = date_of_first_engagement - date_joined
    if time_difference.days >= 0 and time_difference.days < 7:
        return True
    
for i in quality_engagements:
    if i['num_courses_visited'] > 0:
        i['had_visited'] = 1
    else:
        i['had_visited'] = 0
    
first_week_engagements = []
for i in quality_engagements:
    if engagements_within_first_week(accounts_in_good_standing[i['account_key']], i['utc_date']):
        first_week_engagements.append(i)
        
print(f"{len(first_week_engagements)}: of all quality accounts, these are the engagements within the first week.")

6919: of all quality accounts, these are the engagements within the first week.

In [27]:
# first_week_engagements[100]
# { 'account_key': num_minutes_spent }
from collections import defaultdict

def compare(data, key_):
    new_data = defaultdict(list)
    for i in data:
        key = i[key_]
        new_data[key].append(i)
    return new_data

engagements_grouped_by_account = compare(first_week_engagements, 'account_key')
# for i in engagements_grouped_by_account.items():
#     print(i)
#     break

In [28]:
# Question: How many minutes did each student spend online during the first week

def sum_records(data, field):
    new_data = dict()
    for k, v in data.items():
        sum_ = 0
        for i in v:
            sum_ += i[field]
        new_data[k] = sum_
    return new_data
        
minutes_per_account = sum_records(engagements_grouped_by_account, 'total_minutes_visited')
minutes_per_account

{'0': 494.88049616599994,
 '1': 18.576384666670002,
 '2': 0.0,
 '3': 0.0,
 '4': 33.3214046667,
 '5': 329.7578566663,
 '6': 780.4545511666701,
 '7': 104.20388850009999,
 '8': 989.113641833,
 '9': 448.471384167,
 '10': 130.12347833367,
 '11': 0.0,
 '12': 179.4719088333,
 '13': 1013.3833969996999,
 '14': 65.6221875,
 '15': 983.375040335,
 '16': 119.12030049999998,
 '17': 235.49969150033,
 '18': 155.1361575,
 '19': 0.0,
 '20': 447.93897783336996,
 '21': 931.1036911666699,
 '22': 657.2052335000001,
 '23': 1591.3228143334,
 '24': 943.188117167,
 '25': 0.0,
 '26': 430.801675833,
 '27': 1579.12122666663,
 '28': 766.256315667,
 '29': 556.1906033333,
 '30': 69.6578351667,
 '31': 0.0,
 '32': 123.2915048333,
 '33': 253.9870258334,
 '34': 180.413814,
 '35': 765.6402170004,
 '36': 809.2138958339,
 '37': 1378.195091668,
 '38': 0.0,
 '39': 1001.5888595,
 '40': 478.21952616690004,
 '41': 511.925391,
 '42': 576.4643026663,
 '43': 88.822038,
 '44': 0.0,
 '45': 0.0,
 '46': 26.1189351667,
 '47': 854.8288881656,
 '48': 1055.6872196667,
 '49': 0.0,
 '50': 491.9087078335,
 '51': 0.0,
 '52': 3.22752383333,
 '53': 401.97479050029995,
 '54': 427.764673834,
 '55': 589.6171318323301,
 '56': 106.72208133333001,
 '57': 91.3514995,
 '58': 1024.109326834,
 '59': 47.1679638333,
 '60': 0.0,
 '61': 496.99219366667,
 '62': 293.383122167,
 '63': 465.58233333400005,
 '64': 346.5030268336,
 '65': 422.27366000010005,
 '66': 6.95969283333,
 '67': 856.8375048337,
 '68': 0.0,
 '69': 0.0,
 '70': 310.04241416702996,
 '71': 53.5545175,
 '72': 704.5521115003299,
 '73': 0.0,
 '74': 90.48065633329999,
 '75': 20.8106506667,
 '76': 186.549237333,
 '77': 231.80801666640002,
 '78': 0.0,
 '79': 416.49598383333,
 '80': 106.2245978334,
 '81': 227.6363853331,
 '82': 537.5285965007,
 '83': 293.4918854997,
 '84': 752.4780518326,
 '85': 500.4921706667001,
 '86': 0.0,
 '87': 1035.306503999,
 '88': 0.0,
 '89': 63.79716583327,
 '90': 114.43403466663,
 '91': 84.9883638333,
 '92': 611.3200641666999,
 '93': 751.2236896667,
 '94': 0.0,
 '96': 45.3963998333,
 '97': 8.46994183333,
 '98': 525.6444536663,
 '99': 317.10422516660003,
 '100': 145.70615016660003,
 '101': 148.7306783333,
 '102': 277.0299235,
 '103': 1075.0625133337,
 '104': 839.123771167,
 '105': 312.1800340007,
 '106': 29.0687406666,
 '107': 171.2928940001,
 '108': 164.27089083347,
 '109': 1167.52455983297,
 '110': 1214.55291799937,
 '111': 169.159592167,
 '112': 388.23059683327006,
 '113': 83.7769855,
 '114': 186.94018933324,
 '115': 167.606683,
 '116': 886.0703749999001,
 '117': 129.2449371666,
 '118': 891.8733579995999,
 '119': 672.9427816664,
 '120': 266.1378745,
 '121': 285.36239183329997,
 '122': 530.1415103337,
 '123': 0.0,
 '124': 51.0695815,
 '125': 1410.5316330013002,
 '126': 33.4956098333,
 '127': 334.5606256663,
 '128': 743.1407118340001,
 '129': 101.387314333,
 '130': 0.0,
 '131': 0.0,
 '132': 1196.803629999,
 '133': 80.2133103333,
 '134': 1017.1034851664001,
 '135': 613.2567715002999,
 '136': 34.1685658333,
 '137': 696.2475044997,
 '138': 90.3995656667,
 '139': 86.4587005,
 '140': 2050.1156751667004,
 '141': 544.992658666,
 '142': 201.21822283370003,
 '143': 405.0228675003,
 '144': 384.69492683359994,
 '145': 893.4411686660001,
 '146': 11.554518,
 '147': 0.0,
 '148': 0.0,
 '149': 56.835209,
 '150': 414.14088366667,
 '151': 908.4660900005999,
 '152': 745.1146233329999,
 '153': 116.8988095,
 '154': 736.9791355,
 '155': 0.0,
 '156': 635.5124964993,
 '157': 8.3032715,
 '158': 0.0,
 '159': 0.0,
 '160': 630.1675615003,
 '161': 531.8882431671,
 '162': 532.6464248333,
 '163': 3564.7332644989997,
 '164': 765.55279683203,
 '165': 962.5736773336,
 '166': 0.0,
 '167': 0.0,
 '168': 120.87673000033001,
 '169': 92.5594045,
 '170': 586.7042849994001,
 '171': 1887.391213833,
 '172': 589.8798286670001,
 '173': 12.9807116667,
 '174': 414.12743866659997,
 '175': 2375.7954986677,
 '176': 1051.5771371676,
 '177': 570.776941833,
 '178': 783.3383063341,
 '179': 913.6758890002999,
 '180': 95.4642313333,
 '181': 651.9806806667,
 '182': 310.2486779997,
 '183': 418.01940599970004,
 '184': 247.9964674996,
 '185': 0.0,
 '186': 601.3632028330001,
 '187': 629.3766914993301,
 '188': 6.20617616667,
 '189': 1251.6466043334,
 '190': 7.94751166667,
 '191': 137.2655706667,
 '192': 402.42499849989997,
 '193': 121.07599299993,
 '194': 315.44705699977,
 '195': 1166.4244791677,
 '196': 383.1542506668,
 '197': 931.3076661670001,
 '198': 809.546996001,
 '199': 1452.709982333,
 '200': 448.5325424996,
 '201': 0.0,
 '202': 219.2389440004,
 '203': 605.7708455,
 '204': 686.7681608344001,
 '205': 315.34049566659996,
 '206': 633.1473566663,
 '207': 114.39214366666,
 '208': 356.77551816640005,
 '209': 4.55604183333,
 '210': 421.2835453327,
 '211': 593.1472776666001,
 '212': 168.3080953333,
 '213': 836.3458141666999,
 '214': 30.3670653333,
 '215': 662.64059800003,
 '216': 58.36346116669999,
 '217': 0.0,
 '218': 2393.5421573319004,
 '219': 272.6840003337,
 '220': 467.6978279993,
 '221': 178.70479883369998,
 '222': 241.8322233337,
 '223': 151.60938049966,
 '224': 30.647238166630004,
 '225': 247.9695998334,
 '226': 439.05929566669994,
 '227': 485.78090949999995,
 '228': 360.4108591662,
 '229': 131.7264965,
 '230': 197.41214399993,
 '231': 9.75699783333,
 '232': 1168.2526861667002,
 '233': 197.0435864997,
 '234': 931.3838908327,
 '235': 0.0,
 '236': 467.5716475007,
 '237': 704.5008775003,
 '238': 330.1826238337,
 '239': 40.220247,
 '240': 0.0,
 '241': 288.9210591667,
 '242': 554.59261383367,
 '243': 46.605140666699995,
 '244': 123.5804105,
 '245': 669.9961104997,
 '246': 277.3369746671,
 '248': 183.134135333,
 '249': 877.8003651663,
 '250': 284.6907063333,
 '251': 175.613687167,
 '252': 343.35795733340007,
 '253': 0.0,
 '254': 600.5757328336,
 '255': 221.72389316627002,
 '256': 0.0,
 '257': 39.485681500000005,
 '258': 595.2719906673,
 '259': 736.3565788330001,
 '260': 638.934161833,
 '261': 0.0,
 '262': 42.4569508333,
 '263': 417.4064971669,
 '264': 110.09569266679999,
 '265': 371.26458716729996,
 '266': 1420.1479191659998,
 '267': 211.5840809997,
 '268': 314.3331800003,
 '269': 322.475557667,
 '270': 1020.3306876671,
 '271': 830.83625116633,
 '272': 1203.2224428333002,
 '273': 70.48434450007001,
 '274': 1435.0160603327001,
 '275': 44.477798999970005,
 '276': 429.03252133340004,
 '277': 884.915487,
 '278': 0.0,
 '279': 143.048056833,
 '280': 255.53718516670003,
 '281': 0.0,
 '282': 570.5658495,
 '283': 269.194508,
 '284': 302.608719833,
 '285': 109.141489,
 '286': 195.9300631667,
 '287': 283.36202233326,
 '288': 4.58531166667,
 '289': 955.78319766497,
 '290': 442.37721166627,
 '291': 0.0,
 '292': 192.665344,
 '293': 497.8218254996,
 '294': 405.600248833,
 '295': 421.6092228329,
 '296': 199.06043566667,
 '297': 338.6783199997,
 '298': 213.4699951663,
 '299': 0.0,
 '300': 88.12990766662999,
 '301': 669.9500983341,
 '302': 165.37368716699999,
 '303': 2700.4878774989998,
 '304': 194.7560403337,
 '305': 538.88974533303,
 '306': 0.0,
 '307': 4.19664316667,
 '308': 554.8758693333999,
 '309': 150.7999871667,
 '310': 843.170594833,
 '311': 59.239222,
 '313': 888.6124170002998,
 '314': 1341.720517667,
 '315': 657.0126268326,
 '316': 1735.943607166,
 '317': 2778.3161446706704,
 '318': 196.3044158337,
 '319': 343.6706583329,
 '320': 859.426280833,
 '321': 0.0,
 '322': 0.0,
 '323': 397.24734133329997,
 '324': 1669.9007213329999,
 '325': 370.8747679997,
 '326': 1426.2515225012999,
 '327': 355.96292199997,
 '328': 667.7495933323299,
 '329': 638.196504333,
 '330': 187.9226685,
 '331': 501.941580166,
 '332': 124.52342500033,
 '333': 129.087694,
 '334': 0.0,
 '335': 855.4038108340001,
 '336': 278.6769970004,
 '337': 0.0,
 '338': 13.2610473333,
 '339': 0.0,
 '340': 392.473794834,
 '341': 35.531418,
 '342': 0.0,
 '343': 83.295313,
 '344': 614.9778563333,
 '345': 246.61175300029998,
 '346': 248.12435916639998,
 '347': 713.3479524992999,
 '348': 0.0,
 '349': 211.3875440003,
 '350': 107.74437683336001,
 '351': 320.97561616674,
 '352': 729.8468485,
 '353': 122.07255516670001,
 '354': 609.2861186673,
 '355': 944.5557876659999,
 '356': 64.7772518334,
 '357': 105.06483083340001,
 '358': 71.4977216667,
 '359': 2530.5614099997,
 '360': 677.2790736659999,
 '361': 1053.7764165013,
 '362': 58.3151085,
 '363': 0.0,
 '364': 0.0,
 '365': 37.6347753333,
 '366': 23.55166316667,
 '367': 220.21062866679998,
 '368': 817.9997333323399,
 '369': 42.3843405,
 '370': 0.0,
 '371': 4.24015233333,
 '372': 197.066153,
 '373': 532.5829673333,
 '374': 30.5476253333,
 '375': 506.55911883299996,
 '376': 65.9101326667,
 '377': 803.3391453328,
 '378': 0.0,
 '379': 391.3939735,
 '380': 51.9296121667,
 '381': 0.0,
 '382': 73.6446115,
 '383': 212.1774728337,
 '384': 925.7537420007,
 '385': 446.4724451667,
 '386': 0.0,
 '387': 0.0,
 '388': 1208.05215466633,
 '389': 131.7464566667,
 '390': 137.9929768333,
 '391': 0.0,
 '392': 427.5369333332,
 '393': 3.3318835,
 '394': 808.5665558337,
 '395': 2.17768916667,
 '396': 0.0,
 '397': 34.50448516667,
 '398': 12.05914466667,
 '399': 177.5920131668,
 '400': 239.61664966700002,
 '401': 0.0,
 '402': 0.0,
 '403': 604.355107166,
 '404': 611.4195701674,
 '405': 741.2804391669999,
 '406': 57.2638435,
 '407': 500.9127926667,
 '408': 59.7725306667,
 '409': 364.480768,
 '410': 951.118714666,
 '411': 0.0,
 '412': 55.49376599997,
 '413': 578.9502861663,
 '414': 68.0673978333,
 '415': 0.0,
 '416': 722.84210483367,
 '417': 22.14904683337,
 '418': 86.7824926667,
 '419': 6.72066133333,
 '420': 96.80278150000001,
 '421': 357.275143834,
 '422': 311.1889536663,
 '423': 127.15142850000001,
 '424': 0.0,
 '425': 975.587918167,
 '426': 0.0,
 '427': 413.5420181666,
 '428': 726.26075933267,
 '429': 0.0,
 '430': 1024.0636758326,
 '431': 77.9742268333,
 '432': 437.22883383330003,
 '433': 81.51043433337,
 '434': 696.5725646662999,
 '435': 433.22729549969995,
 '436': 858.37418699973,
 '437': 39.4918656667,
 '438': 363.94914149996,
 '439': 847.38115366667,
 '440': 45.9874008334,
 '441': 1065.2951291673999,
 '442': 184.162204667,
 '443': 1001.813550333,
 '444': 0.0,
 '445': 46.3023048333,
 '446': 90.90472849993,
 '447': 119.916663667,
 '449': 20.247478,
 '450': 1096.72738949933,
 '451': 79.9306696666,
 '452': 36.434234,
 '453': 514.86060716603,
 '454': 141.19407999967,
 '455': 438.50690233336,
 '456': 27.37808133337,
 '457': 547.552952834,
 '458': 0.0,
 '459': 943.8555468324001,
 '460': 116.03298466660002,
 '461': 89.6344988334,
 '462': 749.194206334,
 '463': 633.4301786670001,
 '464': 503.05470083299997,
 '465': 53.1803671667,
 '466': 131.94636750003,
 '467': 207.27739616670002,
 '468': 224.91582050030001,
 '469': 884.7240451653,
 '471': 68.2496686666,
 '472': 174.4431463334,
 '473': 0.0,
 '474': 285.75573750030003,
 '475': 164.161086,
 '476': 46.6148,
 '477': 779.5860966676,
 '478': 4.45095966667,
 '479': 316.43186650009994,
 '480': 0.0,
 '481': 599.325108667,
 '482': 29.5289625001,
 '483': 716.3825241659999,
 '484': 18.786721,
 '485': 411.84511316623,
 '486': 188.8958254999,
 '487': 551.1900968329701,
 '488': 101.401498833,
 '489': 829.9734088337,
 '490': 32.447970500029996,
 '491': 640.0351108333,
 '492': 0.0,
 '493': 586.7405209996,
 '494': 591.1435670003,
 '495': 414.253240333,
 '496': 1217.1688571673,
 '497': 448.741092333,
 '498': 385.2513571667001,
 '499': 367.3854126667,
 '500': 229.2620115,
 '501': 32.8227305,
 '502': 504.04492916670006,
 '503': 2.8138905,
 '504': 388.7726185,
 '505': 459.3740381662999,
 '506': 75.8750386667,
 '507': 92.3539813334,
 '508': 736.5973803337,
 '509': 307.0653258337,
 '510': 143.78600349967,
 '511': 493.53649199967003,
 '512': 4.26499566667,
 '513': 626.2345113327,
 '514': 62.84829066659999,
 '515': 265.47810483300003,
 '516': 454.17951166700004,
 '517': 1381.1028195004,
 '518': 980.5763799994,
 '519': 231.0283105,
 '520': 109.5149769999,
 '521': 406.0453698336,
 '522': 303.55134400000003,
 '523': 61.33310733329999,
 '524': 0.0,
 '525': 0.0,
 '526': 670.3438828333,
 '527': 256.4187193326,
 '528': 514.0743979996,
 '529': 0.0,
 '530': 1896.7540938320003,
 '531': 594.0435458336,
 '532': 422.6295078334,
 '533': 455.19857933369997,
 '534': 609.6590520007001,
 '535': 629.7823334996999,
 '536': 0.0,
 '537': 30.6256575,
 '538': 7.1116735,
 '539': 172.5712248333,
 '540': 440.96130916723,
 '541': 20.879544833329998,
 '542': 1036.951593167,
 '543': 183.7893518334,
 '544': 1421.7436063333,
 '545': 307.7543378337,
 '546': 41.7786686667,
 '547': 0.0,
 '548': 769.207330667,
 '549': 32.0522478333,
 '550': 18.9512853333,
 '551': 0.0,
 '552': 932.3012898327,
 '553': 507.1024986672999,
 '554': 272.16654083369997,
 '555': 294.34356566670004,
 '556': 187.25140866697,
 '557': 1245.8182150003,
 '558': 0.0,
 '559': 105.24544450007,
 '560': 61.7853381666,
 '561': 52.4319528333,
 '562': 326.448714,
 '563': 21.972605,
 '564': 18.4937245,
 '565': 518.1875990003,
 '566': 133.319127167,
 '567': 321.3727448333,
 '568': 28.9028346666,
 '569': 1477.0239483322998,
 '570': 173.9382718334,
 '571': 0.0,
 '572': 907.111293668,
 '573': 924.2469394994,
 '574': 0.0,
 '575': 400.8135763341,
 '576': 911.11994133237,
 '577': 120.55847799993,
 '578': 28.5667518333,
 '579': 298.253430333,
 '580': 712.1588875006701,
 '581': 122.48917700033,
 '582': 2.4822425,
 '583': 762.169280667,
 '584': 0.0,
 '585': 535.00554450033,
 '586': 77.7392298333,
 '587': 9.64132116667,
 '588': 84.6351145,
 '589': 4.56274816667,
 '590': 0.0,
 '591': 0.0,
 '592': 488.40353200030006,
 '593': 0.0,
 '594': 0.0,
 '595': 335.5259626667,
 '596': 311.07236283327,
 '597': 1047.649452501,
 '598': 399.2498304993,
 '599': 146.89298433300002,
 '600': 24.87366349997,
 '601': 0.0,
 '602': 615.9597956661,
 '603': 207.9139188337,
 '604': 1890.9937024994,
 '605': 218.3752333334,
 '606': 456.3332818333,
 '607': 547.7397464997,
 '608': 248.29428850003,
 '609': 73.7238143333,
 '610': 653.1940411656001,
 '611': 382.93037050067,
 '612': 52.9136506667,
 '613': 545.9623025,
 '614': 101.1193401667,
 '615': 108.47527400000001,
 '616': 321.2057135,
 '617': 432.987765666,
 '618': 513.8126981664001,
 '619': 1482.9020456663002,
 '620': 557.5625511664,
 '621': 204.02415449966998,
 '622': 396.82058733329995,
 '623': 230.70437450010002,
 '624': 1026.8480728333,
 '625': 0.0,
 '626': 95.1225038333,
 '627': 1047.4820013337,
 '628': 203.3427993337,
 '629': 374.365616,
 '630': 394.5387589999,
 '631': 237.7646521667,
 '632': 84.558989,
 '633': 1689.189059835,
 '634': 223.73943383300002,
 '635': 80.5941101667,
 '636': 169.3917738333,
 '637': 89.0572956666,
 '639': 416.14186616669997,
 '640': 0.0,
 '641': 340.70627749999994,
 '642': 421.960349833,
 '643': 793.6706421670001,
 '644': 488.3752611667,
 '645': 847.3979861667,
 '646': 264.5287276666,
 '647': 73.5741316667,
 '648': 129.1323983333,
 '649': 700.4743598327,
 '650': 114.84451633329999,
 '651': 1346.7158483327,
 '652': 479.86306116670005,
 '653': 736.4371648339999,
 '655': 177.8367486667,
 '656': 0.0,
 '657': 0.0,
 '660': 193.848226,
 '661': 92.5547231666,
 '665': 0.0,
 '666': 138.052647,
 '667': 144.1243173333,
 '669': 0.0,
 '670': 454.273163499,
 '671': 115.15559099992998,
 '672': 32.816891,
 '673': 348.39415716703,
 '674': 171.593366833,
 '676': 16.5745846667,
 '678': 100.0702155,
 '682': 25.243540000000003,
 '686': 9.61211033333,
 '687': 18.889756499999997,
 '689': 0.0,
 '690': 0.0,
 '692': 16.604203,
 '693': 0.0,
 '694': 198.6962631669,
 '696': 666.3290910003,
 '697': 88.1119545,
 '698': 56.45108966666999,
 '702': 0.0,
 '704': 0.0,
 '705': 0.0,
 '706': 1329.9598305,
 '709': 88.0103965,
 '710': 3.56199133333,
 '712': 253.23675750029997,
 '713': 139.060529,
 '715': 307.3006509996,
 '718': 0.0,
 '719': 9.4907925,
 '720': 401.81893949967,
 '722': 29.9067615,
 '726': 21.1284496667,
 '729': 0.0,
 '730': 41.7199715,
 '732': 219.926066667,
 '735': 0.0,
 '736': 313.50181033333,
 '742': 489.7736965,
 '743': 0.0,
 '744': 374.5761038331,
 '746': 706.5435295006,
 '747': 0.0,
 '748': 324.6302378336,
 '751': 52.1289673334,
 '752': 30.5951761667,
 '753': 116.628876833,
 '754': 413.3262124997,
 '755': 34.0330873333,
 '756': 0.0,
 '757': 354.6223496663,
 '759': 0.0,
 '761': 100.06368333333,
 '762': 85.29257,
 '764': 59.340783666700005,
 '769': 135.6825435,
 '771': 275.16640700005996,
 '773': 0.0,
 '776': 0.0,
 '777': 199.31994916669998,
 '778': 48.1974151667,
 '779': 4.2604045,
 '780': 0.0,
 '781': 0.0,
 '782': 277.8489021664,
 '784': 176.3818004999,
 '785': 4.78649716667,
 '786': 23.695871500029998,
 '787': 0.0,
 '791': 417.953548167,
 '792': 1369.641421833,
 '793': 0.0,
 '794': 146.9410850001,
 '796': 0.0,
 '797': 0.0,
 '798': 397.8826263333,
 '800': 122.87407133333,
 '801': 0.0,
 '804': 22.7346656667,
 '805': 84.1050015,
 '806': 49.937148999970006,
 '808': 106.2993215,
 '811': 1138.3177014993998,
 '812': 1764.5367983344001,
 '816': 0.0,
 '822': 2.30081433333,
 '823': 0.0,
 '824': 260.47024649996,
 '825': 27.3957285,
 '828': 345.17664533360005,
 '829': 129.762569,
 '831': 51.016355999999995,
 '832': 0.0,
 '833': 2.38093233333,
 '834': 21.5715365,
 '835': 0.0,
 '836': 29.38455616663,
 '839': 13.587055,
 '840': 0.0,
 '843': 924.060058833,
 '844': 817.60166266567,
 '846': 32.6861011667,
 '851': 58.5606146667,
 '852': 214.54059633330002,
 '853': 5.92106983333,
 '854': 64.29995600000001,
 '855': 92.6896001666,
 '856': 0.0,
 '857': 0.0,
 '858': 260.94864483347,
 '859': 2.54122166667,
 '864': 53.1295885,
 '866': 0.0,
 '867': 0.0,
 '868': 13.442560666670001,
 '872': 129.3303274997,
 '873': 30.2541315,
 '874': 49.7470893333,
 '877': 26.5230981667,
 '880': 15.5930261667,
 '882': 0.0,
 '883': 235.39055499926997,
 '885': 1403.366643835,
 '887': 62.78241916663,
 '888': 3.3880415,
 '893': 0.0,
 '896': 0.0,
 '897': 22.0889656667,
 '900': 0.0,
 '901': 26.5587726667,
 '905': 108.9832133333,
 '906': 5.75313916667,
 '909': 63.3749175,
 '912': 0.0,
 '913': 72.9583085,
 '916': 65.7383995,
 '918': 21.086721,
 '919': 663.5424139989,
 '920': 156.1449683333,
 '923': 0.0,
 '924': 209.96127933370002,
 '927': 125.44656916667,
 '928': 80.6559995,
 '931': 0.0,
 '932': 0.0,
 '934': 5.03956,
 '937': 160.1049253333,
 '938': 69.45209899999999,
 '939': 0.0,
 '940': 0.0,
 '941': 2.99934966667,
 '946': 131.70276883329998,
 '948': 94.3237553333,
 '950': 107.3523146666,
 '952': 120.657056167,
 '954': 91.64868466669999,
 '955': 240.5959745003,
 '956': 6.80688283333,
 '958': 0.0,
 '965': 666.393701501,
 '966': 8.08317416667,
 '967': 449.6269801663,
 '969': 24.9669023333,
 '972': 96.1137128333,
 '973': 42.35008283337,
 '975': 3.7103945,
 '976': 65.0527071667,
 '977': 3.35443916667,
 '979': 517.8334496674,
 '983': 0.0,
 '984': 68.4192841666,
 '985': 46.494977,
 '986': 182.85550433323,
 '988': 61.420162,
 '989': 0.0,
 '990': 106.08401216677001,
 '992': 39.0104288333,
 '1000': 180.025886167,
 '1001': 16.2005246667,
 '1002': 8.1809285,
 '1007': 0.0,
 '1009': 0.0,
 '1011': 118.71332966671,
 '1013': 4.3800225,
 '1014': 619.9953998326,
 '1015': 38.87817050003,
 '1019': 75.87298200000001,
 '1022': 0.0,
 '1028': 18.8601366667,
 '1029': 3.50885666667,
 '1030': 218.55650866673005,
 '1031': 11.741084,
 '1032': 13.899305166700001,
 '1033': 959.9534376661,
 '1036': 0.0,
 '1038': 0.0,
 '1040': 12.9824898333,
 '1042': 45.5670335,
 '1048': 0.0,
 '1049': 37.853095,
 '1050': 84.5200338333,
 '1052': 117.195806333,
 '1053': 81.4415533333,
 '1054': 0.0,
 '1055': 71.5736406667,
 '1056': 366.5285674997,
 '1058': 0.0,
 '1060': 1768.5227493319999,
 '1062': 366.3194163334,
 '1066': 0.0,
 '1067': 29.7377383333,
 '1070': 1309.1846301673,
 '1071': 0.0,
 '1072': 0.0,
 '1073': 35.81870033337,
 '1074': 0.0,
 '1075': 90.6038805,
 '1077': 152.213267167,
 '1080': 5.51051366667,
 '1081': 0.0,
 '1082': 51.1061375,
 '1087': 179.4080511666,
 '1088': 0.0,
 '1089': 53.190095,
 '1090': 0.0,
 '1094': 464.4721495011001,
 '1095': 30.0975526667,
 '1096': 269.29544283309997,
 '1098': 739.8981633335999,
 '1099': 108.8893720001,
 '1102': 0.0,
 '1103': 0.0,
 '1107': 73.6289658334,
 '1110': 52.90383883333,
 '1111': 0.0,
 '1113': 37.2096841667,
 '1115': 0.0,
 '1117': 0.0,
 '1118': 89.38367816659999,
 '1121': 20.21580533333,
 '1123': 12.6563396667,
 '1124': 0.0,
 '1128': 53.4711175,
 '1130': 137.6759001667,
 '1131': 693.148515833,

In [29]:
# Find the account holder who put in the most minutes

courses_visited_per_account = sum_records(engagements_grouped_by_account, 'num_courses_visited')
courses_visited_per_account

for k, v in courses_visited_per_account.items():
    if v == max(courses_visited_per_account.values()):
        print(k, v)

317 25

In [30]:
# for k, v in engagements_grouped_by_account.items():
#     print(k, v)
#     break

In [31]:
# quality_engagements[10]

In [32]:
sum(minutes_per_account.values()) / sum(courses_visited_per_account.values())

77.08380529923245

In [33]:
# What's the ratio of passed/unpassed submissions?b

In [34]:
for i in quality_submissions:
    if i['processing_state'] != 'evaluated'.upper():
        print(i)

{'creation_date': datetime.datetime(2018, 6, 4, 0, 0), 'completion_date': None, 'assigned_rating': '', 'account_key': '313', 'lesson_key': '3176718735', 'processing_state': 'CREATED'}
{'creation_date': datetime.datetime(2018, 2, 12, 0, 0), 'completion_date': None, 'assigned_rating': '', 'account_key': '474', 'lesson_key': '3562208770', 'processing_state': 'CREATED'}
{'creation_date': datetime.datetime(2018, 8, 27, 0, 0), 'completion_date': None, 'assigned_rating': '', 'account_key': '452', 'lesson_key': '3174288624', 'processing_state': 'CREATED'}
{'creation_date': datetime.datetime(2018, 8, 26, 0, 0), 'completion_date': None, 'assigned_rating': '', 'account_key': '500', 'lesson_key': '3165188753', 'processing_state': 'CREATED'}
{'creation_date': datetime.datetime(2018, 8, 27, 0, 0), 'completion_date': None, 'assigned_rating': '', 'account_key': '559', 'lesson_key': '3165188753', 'processing_state': 'CREATED'}
{'creation_date': datetime.datetime(2018, 8, 26, 0, 0), 'completion_date': None, 'assigned_rating': '', 'account_key': '498', 'lesson_key': '3165188753', 'processing_state': 'CREATED'}

In [35]:
for i in quality_submissions:
    if i['completion_date'] is None:
        print(i)

{'creation_date': datetime.datetime(2018, 6, 4, 0, 0), 'completion_date': None, 'assigned_rating': '', 'account_key': '313', 'lesson_key': '3176718735', 'processing_state': 'CREATED'}
{'creation_date': datetime.datetime(2018, 2, 12, 0, 0), 'completion_date': None, 'assigned_rating': '', 'account_key': '474', 'lesson_key': '3562208770', 'processing_state': 'CREATED'}
{'creation_date': datetime.datetime(2018, 8, 27, 0, 0), 'completion_date': None, 'assigned_rating': '', 'account_key': '452', 'lesson_key': '3174288624', 'processing_state': 'CREATED'}
{'creation_date': datetime.datetime(2018, 8, 26, 0, 0), 'completion_date': None, 'assigned_rating': '', 'account_key': '500', 'lesson_key': '3165188753', 'processing_state': 'CREATED'}
{'creation_date': datetime.datetime(2018, 8, 27, 0, 0), 'completion_date': None, 'assigned_rating': '', 'account_key': '559', 'lesson_key': '3165188753', 'processing_state': 'CREATED'}
{'creation_date': datetime.datetime(2018, 8, 26, 0, 0), 'completion_date': None, 'assigned_rating': '', 'account_key': '498', 'lesson_key': '3165188753', 'processing_state': 'CREATED'}

### 4. Finalizing/Summarizing Data

In [36]:
# I wrote my conclusion here

### DO-OVER

In [37]:
# install pandas, unmpy and matplotlib
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [38]:
enrollment_df = pd.read_csv('enrollments.csv')
engagement_df = pd.read_csv('engagements.csv')
submission_df = pd.read_csv('submissions.csv')

In [39]:
pd.Timestamp('2017-11-10').year

2017

In [40]:
enrollment_df

,account_key,status,join_date,cancel_date,days_to_cancel,is_enrolled,is_canceled
0,448,canceled,2017-11-10,2018-01-14,65.0,True,True
1,448,canceled,2017-11-05,2017-11-10,5.0,True,True
2,448,canceled,2018-01-27,2018-01-27,0.0,True,True
3,448,canceled,2017-11-10,2017-11-10,0.0,True,True
4,448,current,2018-03-10,NaN,NaN,True,False
...,...,...,...,...,...,...,...
1635,1176,current,2018-08-12,NaN,NaN,False,False
1636,1110,current,2018-08-13,NaN,NaN,False,False
1637,1116,canceled,2018-08-15,2018-08-18,3.0,False,True
1638,874,current,2018-08-22,NaN,NaN,False,False
1639,686,current,2018-08-23,NaN,NaN,False,False

In [41]:
# help(enrollment_df)
enrollment_df.columns
enrollment_df.index
enrollment_df.dtypes

account_key         int64
status             object
join_date          object
cancel_date        object
days_to_cancel    float64
is_enrolled          bool
is_canceled          bool
dtype: object

In [42]:
d = {
    'my_column': [1, 2, 3], 
    'your_column': [3, 4, 5], 
    'another_column': [5, 6, 7]
}
index = ['first_row', 'second_row', 'third_row', 'fourth_row', 'fifth_row', 'sixth_row', 'seventh_row', 'eighth row']
columns = ['first column', 'second column', 'third column', 'fourth column', 'fifth column', 'sixth column', 'seventh_column', 'eighth_column']
new_d = [[1, 2, "Hello", 4, 5, 6, '9-5', 98], [7, 8, "Goodbye", 10, 11, 12, '10-4', 97], [13, 14, "Greetings", 16, 17, 18, '12-7', np.nan], [19, 20, "Salutations", 22, 23, 24, '7-6', np.nan], [25, 26, "Bonjour", 28, 29, 30, '6-10', np.nan], [31, 32, "Salut", 34, 35, 36, '12-8', 93], [37, 38, "Au Revoir", 40, 41, 42, '9-12', 92], [43, np.nan, "Allo", 46, np.nan, 48, '12-9', 91]]

test_df = pd.DataFrame(data=new_d, index=index, columns=columns)
test_df

,first column,second column,third column,fourth column,fifth column,sixth column,seventh_column,eighth_column
first_row,1,2.0,Hello,4,5.0,6,9-5,98.0
second_row,7,8.0,Goodbye,10,11.0,12,10-4,97.0
third_row,13,14.0,Greetings,16,17.0,18,12-7,NaN
fourth_row,19,20.0,Salutations,22,23.0,24,7-6,NaN
fifth_row,25,26.0,Bonjour,28,29.0,30,6-10,NaN
sixth_row,31,32.0,Salut,34,35.0,36,12-8,93.0
seventh_row,37,38.0,Au Revoir,40,41.0,42,9-12,92.0
eighth row,43,NaN,Allo,46,NaN,48,12-9,91.0

In [43]:
# pd.DataFrame(d, index=index)

In [44]:
# enrollment_df['days_to_cancel']
# enrollment_df.days_to_cancel

# test_df['tertiary column']
# enrollment_df.tertiary column

# Change a column name
# enrollment_df.replace?

# If you do not add inplace as an argument to some dataframe methods, your object will not be changed.
# Solution: add either inplace, or set new dataframe expression/evaluation to the original dataframe

# test_df = test_df.rename(columns={'my column': 'my_column'})
# test_df.rename(columns={'my column': 'my_column'}, inplace=True)
# test_df

test_df.columns = test_df.columns.str.replace(' ', '_')
test_df

,first_column,second_column,third_column,fourth_column,fifth_column,sixth_column,seventh_column,eighth_column
first_row,1,2.0,Hello,4,5.0,6,9-5,98.0
second_row,7,8.0,Goodbye,10,11.0,12,10-4,97.0
third_row,13,14.0,Greetings,16,17.0,18,12-7,NaN
fourth_row,19,20.0,Salutations,22,23.0,24,7-6,NaN
fifth_row,25,26.0,Bonjour,28,29.0,30,6-10,NaN
sixth_row,31,32.0,Salut,34,35.0,36,12-8,93.0
seventh_row,37,38.0,Au Revoir,40,41.0,42,9-12,92.0
eighth row,43,NaN,Allo,46,NaN,48,12-9,91.0

In [45]:
# for i in enrollment_data:
#     i['join_date'] = convert_to_date(i['join_date'])
#     i['cancel_date'] = convert_to_date(i['cancel_date'])
#     i['days_to_cancel'] = convert_to_int(i['days_to_cancel'])
#     i['is_enrolled'] = convert_to_bool(i['is_enrolled'])
#     i['is_canceled'] = convert_to_bool(i['is_canceled'])

In [46]:
# Check for number of records you have
# len(enrollment_df)
# enrollment_df.info()
enrollment_df.tail(1)

,account_key,status,join_date,cancel_date,days_to_cancel,is_enrolled,is_canceled
1639,686,current,2018-08-23,NaN,NaN,False,False

In [47]:
# Check for n number of beginning records
# .head(n)
enrollment_df.head(20)

,account_key,status,join_date,cancel_date,days_to_cancel,is_enrolled,is_canceled
0,448,canceled,2017-11-10,2018-01-14,65.0,True,True
1,448,canceled,2017-11-05,2017-11-10,5.0,True,True
2,448,canceled,2018-01-27,2018-01-27,0.0,True,True
3,448,canceled,2017-11-10,2017-11-10,0.0,True,True
4,448,current,2018-03-10,NaN,NaN,True,False
5,448,canceled,2018-01-14,2018-01-27,13.0,True,True
6,448,canceled,2018-01-27,2018-03-10,42.0,True,True
7,448,canceled,2018-01-27,2018-01-27,0.0,True,True
8,448,canceled,2018-01-27,2018-01-27,0.0,True,True
9,700,canceled,2017-11-10,2017-11-16,6.0,False,True
10,429,canceled,2017-11-10,2018-03-10,120.0,False,True
11,429,canceled,2018-03-10,2018-06-17,99.0,False,True
12,60,canceled,2017-11-10,2018-01-14,65.0,False,True
13,60,canceled,2018-01-14,2018-04-01,77.0,False,True
14,60,current,2018-04-01,NaN,NaN,False,False
15,1300,canceled,2017-11-10,2017-11-16,6.0,False,True
16,369,current,2017-11-10,NaN,NaN,False,False
17,322,canceled,2017-11-10,2018-02-02,84.0,False,True
18,322,canceled,2018-02-12,2018-02-12,0.0,False,True
19,322,canceled,2018-02-12,2018-03-10,26.0,False,True

In [48]:
# Check for n number of ending records
# .tail(n)
enrollment_df.tail(15)

,account_key,status,join_date,cancel_date,days_to_cancel,is_enrolled,is_canceled
1625,1057,canceled,2018-07-17,2018-07-21,4.0,False,True
1626,689,current,2018-07-17,NaN,NaN,False,False
1627,1278,current,2018-07-17,NaN,NaN,False,False
1628,1272,canceled,2018-07-17,2018-07-23,6.0,False,True
1629,438,current,2018-07-17,NaN,NaN,False,False
1630,992,current,2018-07-17,NaN,NaN,False,False
1631,575,current,2018-07-17,NaN,NaN,False,False
1632,807,canceled,2018-07-20,2018-07-22,2.0,False,True
1633,1298,current,2018-08-11,NaN,NaN,False,False
1634,751,current,2018-08-11,NaN,NaN,False,False
1635,1176,current,2018-08-12,NaN,NaN,False,False
1636,1110,current,2018-08-13,NaN,NaN,False,False
1637,1116,canceled,2018-08-15,2018-08-18,3.0,False,True
1638,874,current,2018-08-22,NaN,NaN,False,False
1639,686,current,2018-08-23,NaN,NaN,False,False

In [49]:
enrollment_df.head(1)

,account_key,status,join_date,cancel_date,days_to_cancel,is_enrolled,is_canceled
0,448,canceled,2017-11-10,2018-01-14,65.0,True,True

In [50]:
# Index into your DataFrame
# enrollment_df.iloc[0]

# enrollment_df.iloc[0:4, 0:5] # gets certain number of records for certain number of columns
# enrollment_df.iloc[:, 0:5] # gets all records and shows certain number of columns
# enrollment_df.iloc[0:4, :] # gets all data for each record
# enrollment_df.iloc[:, [1, 4, 5, 6]] # if you want to get specific columns, you have to pick them manually

In [51]:
# test_df = pd.DataFrame(d, index=index)
# test_df.loc['first_row']

In [52]:
enrollment_df.loc[1625]

account_key             1057
status              canceled
join_date         2018-07-17
cancel_date       2018-07-21
days_to_cancel             4
is_enrolled            False
is_canceled             True
Name: 1625, dtype: object

In [53]:
test_df.iloc[0]

first_column          1
second_column         2
third_column      Hello
fourth_column         4
fifth_column          5
sixth_column          6
seventh_column      9-5
eighth_column        98
Name: first_row, dtype: object

In [54]:
test_df.loc['second_row':'fifth_row']

,first_column,second_column,third_column,fourth_column,fifth_column,sixth_column,seventh_column,eighth_column
second_row,7,8.0,Goodbye,10,11.0,12,10-4,97.0
third_row,13,14.0,Greetings,16,17.0,18,12-7,NaN
fourth_row,19,20.0,Salutations,22,23.0,24,7-6,NaN
fifth_row,25,26.0,Bonjour,28,29.0,30,6-10,NaN

In [55]:
# Whenever performing slicing using either .loc or .iloc, neither of the stop values are inherently exclusive
# It's just that, by default, .iloc's indeces start at 0, which gives the illusion that the slices are exclusive

In [56]:
test_df.sixth_column = test_df.sixth_column.apply(lambda x:x**2)

In [57]:
test_df

,first_column,second_column,third_column,fourth_column,fifth_column,sixth_column,seventh_column,eighth_column
first_row,1,2.0,Hello,4,5.0,36,9-5,98.0
second_row,7,8.0,Goodbye,10,11.0,144,10-4,97.0
third_row,13,14.0,Greetings,16,17.0,324,12-7,NaN
fourth_row,19,20.0,Salutations,22,23.0,576,7-6,NaN
fifth_row,25,26.0,Bonjour,28,29.0,900,6-10,NaN
sixth_row,31,32.0,Salut,34,35.0,1296,12-8,93.0
seventh_row,37,38.0,Au Revoir,40,41.0,1764,9-12,92.0
eighth row,43,NaN,Allo,46,NaN,2304,12-9,91.0

In [58]:
test_df.dtypes

first_column        int64
second_column     float64
third_column       object
fourth_column       int64
fifth_column      float64
sixth_column        int64
seventh_column     object
eighth_column     float64
dtype: object

In [59]:
# test_df.seventh_column.apply(lambda x: x[-1])

In [60]:
d1 = test_df.copy()
d2 = test_df.copy()

d1.seventh_column = d1.seventh_column.str.extract('(\d)')
d2.seventh_column = d2.seventh_column.apply(lambda x: x[-1])

test_df
# test_df.seventh_column.str.replace('-', '/')

,first_column,second_column,third_column,fourth_column,fifth_column,sixth_column,seventh_column,eighth_column
first_row,1,2.0,Hello,4,5.0,36,9-5,98.0
second_row,7,8.0,Goodbye,10,11.0,144,10-4,97.0
third_row,13,14.0,Greetings,16,17.0,324,12-7,NaN
fourth_row,19,20.0,Salutations,22,23.0,576,7-6,NaN
fifth_row,25,26.0,Bonjour,28,29.0,900,6-10,NaN
sixth_row,31,32.0,Salut,34,35.0,1296,12-8,93.0
seventh_row,37,38.0,Au Revoir,40,41.0,1764,9-12,92.0
eighth row,43,NaN,Allo,46,NaN,2304,12-9,91.0

In [61]:
d1

,first_column,second_column,third_column,fourth_column,fifth_column,sixth_column,seventh_column,eighth_column
first_row,1,2.0,Hello,4,5.0,36,9,98.0
second_row,7,8.0,Goodbye,10,11.0,144,1,97.0
third_row,13,14.0,Greetings,16,17.0,324,1,NaN
fourth_row,19,20.0,Salutations,22,23.0,576,7,NaN
fifth_row,25,26.0,Bonjour,28,29.0,900,6,NaN
sixth_row,31,32.0,Salut,34,35.0,1296,1,93.0
seventh_row,37,38.0,Au Revoir,40,41.0,1764,9,92.0
eighth row,43,NaN,Allo,46,NaN,2304,1,91.0

In [62]:
d2

,first_column,second_column,third_column,fourth_column,fifth_column,sixth_column,seventh_column,eighth_column
first_row,1,2.0,Hello,4,5.0,36,5,98.0
second_row,7,8.0,Goodbye,10,11.0,144,4,97.0
third_row,13,14.0,Greetings,16,17.0,324,7,NaN
fourth_row,19,20.0,Salutations,22,23.0,576,6,NaN
fifth_row,25,26.0,Bonjour,28,29.0,900,0,NaN
sixth_row,31,32.0,Salut,34,35.0,1296,8,93.0
seventh_row,37,38.0,Au Revoir,40,41.0,1764,2,92.0
eighth row,43,NaN,Allo,46,NaN,2304,9,91.0

In [63]:
# Drop original records and add the new ones
for i in test_df.index:
    test_df.drop(index=i, inplace=True)
    test_df = test_df.append(d1.loc[i])
    test_df = test_df.append(d2.loc[i])
    
test_df

,first_column,second_column,third_column,fourth_column,fifth_column,sixth_column,seventh_column,eighth_column
first_row,1,2.0,Hello,4,5.0,36,9,98.0
first_row,1,2.0,Hello,4,5.0,36,5,98.0
second_row,7,8.0,Goodbye,10,11.0,144,1,97.0
second_row,7,8.0,Goodbye,10,11.0,144,4,97.0
third_row,13,14.0,Greetings,16,17.0,324,1,NaN
third_row,13,14.0,Greetings,16,17.0,324,7,NaN
fourth_row,19,20.0,Salutations,22,23.0,576,7,NaN
fourth_row,19,20.0,Salutations,22,23.0,576,6,NaN
fifth_row,25,26.0,Bonjour,28,29.0,900,6,NaN
fifth_row,25,26.0,Bonjour,28,29.0,900,0,NaN
sixth_row,31,32.0,Salut,34,35.0,1296,1,93.0
sixth_row,31,32.0,Salut,34,35.0,1296,8,93.0
seventh_row,37,38.0,Au Revoir,40,41.0,1764,9,92.0
seventh_row,37,38.0,Au Revoir,40,41.0,1764,2,92.0
eighth row,43,NaN,Allo,46,NaN,2304,1,91.0
eighth row,43,NaN,Allo,46,NaN,2304,9,91.0

In [64]:
# Show column names
for i in test_df:
    print(i)

first_column
second_column
third_column
fourth_column
fifth_column
sixth_column
seventh_column
eighth_column

In [65]:
# Show one record of data

for i in test_df.index:
    print(test_df.loc[i])
    break
#     print(test_df.iloc[i])

           first_column  second_column third_column  fourth_column  \
first_row             1            2.0        Hello              4
first_row             1            2.0        Hello              4

           fifth_column  sixth_column seventh_column  eighth_column
first_row           5.0            36              9           98.0
first_row           5.0            36              5           98.0

In [66]:
# Figuring out what to do with missing data
test_df.isna().head()

,first_column,second_column,third_column,fourth_column,fifth_column,sixth_column,seventh_column,eighth_column
first_row,False,False,False,False,False,False,False,False
first_row,False,False,False,False,False,False,False,False
second_row,False,False,False,False,False,False,False,False
second_row,False,False,False,False,False,False,False,False
third_row,False,False,False,False,False,False,False,True

In [67]:
test_df.isnull().tail()

,first_column,second_column,third_column,fourth_column,fifth_column,sixth_column,seventh_column,eighth_column
sixth_row,False,False,False,False,False,False,False,False
seventh_row,False,False,False,False,False,False,False,False
seventh_row,False,False,False,False,False,False,False,False
eighth row,False,True,False,False,True,False,False,False
eighth row,False,True,False,False,True,False,False,False

In [68]:
test_df[test_df['first_column'] > 15]

,first_column,second_column,third_column,fourth_column,fifth_column,sixth_column,seventh_column,eighth_column
fourth_row,19,20.0,Salutations,22,23.0,576,7,NaN
fourth_row,19,20.0,Salutations,22,23.0,576,6,NaN
fifth_row,25,26.0,Bonjour,28,29.0,900,6,NaN
fifth_row,25,26.0,Bonjour,28,29.0,900,0,NaN
sixth_row,31,32.0,Salut,34,35.0,1296,1,93.0
sixth_row,31,32.0,Salut,34,35.0,1296,8,93.0
seventh_row,37,38.0,Au Revoir,40,41.0,1764,9,92.0
seventh_row,37,38.0,Au Revoir,40,41.0,1764,2,92.0
eighth row,43,NaN,Allo,46,NaN,2304,1,91.0
eighth row,43,NaN,Allo,46,NaN,2304,9,91.0

In [69]:
test_df.query('first_column > 15')

,first_column,second_column,third_column,fourth_column,fifth_column,sixth_column,seventh_column,eighth_column
fourth_row,19,20.0,Salutations,22,23.0,576,7,NaN
fourth_row,19,20.0,Salutations,22,23.0,576,6,NaN
fifth_row,25,26.0,Bonjour,28,29.0,900,6,NaN
fifth_row,25,26.0,Bonjour,28,29.0,900,0,NaN
sixth_row,31,32.0,Salut,34,35.0,1296,1,93.0
sixth_row,31,32.0,Salut,34,35.0,1296,8,93.0
seventh_row,37,38.0,Au Revoir,40,41.0,1764,9,92.0
seventh_row,37,38.0,Au Revoir,40,41.0,1764,2,92.0
eighth row,43,NaN,Allo,46,NaN,2304,1,91.0
eighth row,43,NaN,Allo,46,NaN,2304,9,91.0

In [70]:
# test_df.query('third_column == \'Salutations\'')
test_df.query("third_column == 'Salutations'")

,first_column,second_column,third_column,fourth_column,fifth_column,sixth_column,seventh_column,eighth_column
fourth_row,19,20.0,Salutations,22,23.0,576,7,NaN
fourth_row,19,20.0,Salutations,22,23.0,576,6,NaN

### Homework

In [71]:
# What was the average number of days to cancel?
enrollment_df.days_to_cancel.mean()

# How many minutes did each student spend online during the first week


# How many enrollees have active engagement within the first week?

# Find the account holder who put in the most minutes.

43.917004048582996

In [72]:
import time as t
startt = t.time()
print(startt)

1601579682.0778685

In [73]:
starttime = t.time()
starttime
fwe_df = pd.DataFrame(data = [[x, engagement_df.query(f"acct == {x}").head(7)['total_minutes_visited'].sum()] for x in list(set(list(engagement_df['acct'])))] , columns = ['Acct_no', 'First_Week_Engagement'])
print(t.time()-starttime)

3.8897194862365723

In [74]:
fwe_df

      Acct_no  First_Week_Engagement
0           0             494.880496
1           1              18.576385
2           2               0.000000
3           3             827.906774
4           4              33.321405
...       ...                    ...
1232     1300              13.387217
1233     1301               6.202126
1234     1302               0.000000
1235     1303              35.315063
1236     1305               9.771474

[1237 rows x 2 columns]

In [75]:
i = 1301
engagement_df.query(f"acct == {i}").head(7)['total_minutes_visited'].sum()

6.2021255

In [76]:
list(set(list(engagement_df['acct'])))[0]

0